app/helpers/application_helper.rb

SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."link_id" = $2 LIMIT $3  [["user_id", 2], ["link_id", 6], ["LIMIT", 1]]
---
  def liked_by_user?(link_id)
    Like.where(user_id: current_user.id, link_id: link_id).any?