app/controllers/likes_controller.rb

  def create
    like = Like.find_or_initialize_by(user_id: current_user.id, link_id: like_params[:link_id])
    if like.save
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."link_id" = $2 LIMIT $3  [["user_id", 2], ["link_id", 2], ["LIMIT", 1]]
UPDATE "links" SET "likes_count" = COALESCE("likes_count", 0) + 1 WHERE "links"."id" = $1  [["id", 2]]

  def destroy
    like = Like.find_by(link_id: params[:id], user_id: current_user.id)
    like.destroy!
---
SELECT  "likes".* FROM "likes" WHERE "likes"."link_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["link_id", 6], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]