app/controllers/links_controller.rb

SELECT "links".* FROM "links" ORDER BY likes_count DESC
---
  def index
    @links_by_date = Link.top.group_by{ |l| l.created_at.to_date }

INSERT INTO "links" ("url", "title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["url", ""], ["title", "sv"], ["user_id", 1], ["created_at", "2019-09-03 09:34:43.660237"], ["updated_at", "2019-09-03 09:34:43.660237"]]
---
  def create
    @link = current_user.links.build(title: link_params[:title], url: link_params[:url])
    if @link.save

SELECT  "links".* FROM "links" WHERE "links"."user_id" = $1 AND "links"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 8], ["LIMIT", 1]]
DELETE FROM "links" WHERE "links"."id" = $1  [["id", 8]]
---
  def destroy
    link = current_user.links.find(params[:id])
    if link.destroy